# US - Baby Names

### Introduction:

We are going to use a subset of [US Baby Names](https://www.kaggle.com/kaggle/us-baby-names) from Kaggle.  
In the file it will be names from 2004 until 2014


### Step 1. Import the necessary libraries

In [99]:
import pandas as pd
import numpy as np

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv).

In [7]:
!wget https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv

--2020-10-23 03:29:12--  https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv
Resolving raw.githubusercontent.com (raw.githubusercontent.com)... 151.101.0.133, 151.101.64.133, 151.101.128.133, ...
Connecting to raw.githubusercontent.com (raw.githubusercontent.com)|151.101.0.133|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 35762695 (34M) [text/plain]
Saving to: ‘US_Baby_Names_right.csv’

US_Baby_Names_right 100%[===================>]  34.11M   101MB/s    in 0.3s

2020-10-23 03:29:14 (101 MB/s) - ‘US_Baby_Names_right.csv’ saved [35762695/35762695]

### Step 3. Assign it to a variable called baby_names.

In [11]:
baby_names = pd.read_csv('US_Baby_Names_right.csv', sep=',')

### Step 4. See the first 10 entries

In [10]:
baby_names.head(10)

   Unnamed: 0     Id      Name  Year Gender State  Count
0       11349  11350      Emma  2004      F    AK     62
1       11350  11351   Madison  2004      F    AK     48
2       11351  11352    Hannah  2004      F    AK     46
3       11352  11353     Grace  2004      F    AK     44
4       11353  11354     Emily  2004      F    AK     41
5       11354  11355   Abigail  2004      F    AK     37
6       11355  11356    Olivia  2004      F    AK     33
7       11356  11357  Isabella  2004      F    AK     30
8       11357  11358    Alyssa  2004      F    AK     29
9       11358  11359    Sophia  2004      F    AK     28

### Step 5. Delete the column 'Unnamed: 0' and 'Id'

In [15]:
baby_names.drop(['Unnamed: 0', 'Id'], axis=1, inplace=True)
baby_names.head()

      Name  Year Gender State  Count
0     Emma  2004      F    AK     62
1  Madison  2004      F    AK     48
2   Hannah  2004      F    AK     46
3    Grace  2004      F    AK     44
4    Emily  2004      F    AK     41

### Step 6. Are there more male or female in the dataset?

In [20]:
baby_names.groupby(['Gender'])['Count'].sum().idxmax()

'M'

### Step 7. Group the dataset by name and assign to names

In [73]:
names = baby_names['Name'].drop_duplicates().sort_values()
names.values

array(['Aaban', 'Aadan', 'Aadarsh', ..., 'Zyren', 'Zyria', 'Zyriah'],
      dtype=object)

### Step 8. How many different names exist in the dataset?

In [76]:
len(names)

17632

### Step 9. What is the name with most occurrences?

In [82]:
baby_names.groupby(['Name'])['Count'].sum().idxmax()

'Jacob'

### Step 10. How many different names have the least occurrences?

In [97]:
names_count = baby_names.groupby(['Name'])['Count'].sum()
sum(names_count.values==names_count.min())

2578

### Step 11. What is the median name occurrence?

In [102]:
names_count[names_count.values==np.median(names_count.values)]

Name
Aishani       49
Alara         49
Alysse        49
Ameir         49
Anely         49
Antonina      49
Aveline       49
Aziah         49
Baily         49
Caleah        49
Carlota       49
Cristine      49
Dahlila       49
Darvin        49
Deante        49
Deserae       49
Devean        49
Elizah        49
Emmaly        49
Emmanuela     49
Envy          49
Esli          49
Fay           49
Gurshaan      49
Hareem        49
Iven          49
Jaice         49
Jaiyana       49
Jamiracle     49
Jelissa       49
              ..
Kyndle        49
Kynsley       49
Leylanie      49
Maisha        49
Malillany     49
Mariann       49
Marquell      49
Maurilio      49
Mckynzie      49
Mehdi         49
Nabeel        49
Nalleli       49
Nassir        49
Nazier        49
Nishant       49
Rebecka       49
Reghan        49
Ridwan        49
Riot          49
Rubin         49
Ryatt         49
Sameera       49
Sanjuanita    49
Shalyn        49
Skylie        49
Sriram        49
Trinton       49
Vita          49
Yoni          49
Zuleima       49
Name: Count, Length: 66, dtype: int64

### Step 12. What is the standard deviation of names?

In [103]:
np.std(names_count.values)

11005.757358500688

### Step 13. Get a summary with the mean, min, max, std and quartiles.

In [107]:
pd.DataFrame(names_count).describe()

               Count
count   17632.000000
mean     2008.932169
std     11006.069468
min         5.000000
25%        11.000000
50%        49.000000
75%       337.000000
max    242874.000000